In [7]:
import pandas as pd
import sqlite3
import os

In [8]:
db = sqlite3.connect("Monarchs1996.db")

In [9]:
df = pd.read_csv("1996 Season Summary.csv")

        #convert pandas to SQL table
df.to_sql("monarchs1996", db, if_exists="replace")

os.getcwd()

'C:\\Users\\Arink\\Desktop\\github\\CodeLou\\Monarchs\\Data'

In [10]:
schema = pd.read_sql('SELECT * FROM sqlite_master ORDER by name', db)
schema

,type,name,tbl_name,rootpage,sql
0,index,ix_monarchs1996_index,monarchs1996,3,"CREATE INDEX ""ix_monarchs1996_index""ON ""monarc..."
1,table,monarchs1996,monarchs1996,2,"CREATE TABLE ""monarchs1996"" (\n""index"" INTEGER..."

## Checking DataType

In [11]:
data_type = pd.read_sql('SELECT * FROM PRAGMA_TABLE_INFO("monarchs1996")', db)
data_type

    cid                      name     type  notnull dflt_value  pk
0     0                     index  INTEGER        0       None   0
1     1                   Tag No.     TEXT        0       None   0
2     2                  Mon\nSex     TEXT        0       None   0
3     3                    Tagger     TEXT        0       None   0
4     4              Where Tagged     TEXT        0       None   0
5     5              Date\nTagged     TEXT        0       None   0
6     6           Date\nRecovered     TEXT        0       None   0
7     7          Where\nRecovered     TEXT        0       None   0
8     8  Observed or\nReported by     TEXT        0       None   0
9     9                Unnamed: 8     TEXT        0       None   0
10   10               Inter-\nval     TEXT        0       None   0
11   11               Unnamed: 10     REAL        0       None   0
12   12             Est.\nistance     TEXT        0       None   0
13   13               Unnamed: 12     TEXT        0       None   0
14   14               Unnamed: 13     TEXT        0       None   0

### Thats alot of columns,

In [12]:
df

,Tag No.,Mon\nSex,Tagger,Where Tagged,Date\nTagged,Date\nRecovered,Where\nRecovered,Observed or\nReported by,Unnamed: 8,Inter-\nval,Unnamed: 10,Est.\nistance,Unnamed: 12,Unnamed: 13
0,IV 301,M,Linnea Evans/Kevin Young\nKenyon-Wanamingo M. S.,"Wanamingo,\nMN",9/4/96,3/4/97,"Sierra Chincua,\nMexico",Lincoln\nBrower,NaN,mo,NaN,760 m,NaN,NaN
1,MC 648,M,Gary Cadogan,"Mt. Carroll, IL",9/30/96,Feb. 97,"El Rosario,\nMexico",Don Davis/\nLeonard\nHooton,NaN,mo,NaN,660 m,NaN,NaN
2,EB 370,F,Aaron Wurtz/T. Callender\nWamego High School,"Wamego, KS",9/18/96,Feb. 97,"El Rosario,\nMexico",David\nMarriott,NaN,mo,NaN,375 m,NaN,NaN
3,MK 276,F,Billy Dreball/T. Callender\nWamego High School,"Wamego, KS",9/14/96,Feb. 97,"La Herrada,\nMexico",David\nMarriott,NaN,mo,NaN,375 m,NaN,NaN
4,KN 176,F,Melissa Brooks/T. Callender\nWamego High School,"Wamego, KS",9/12/96,3/10/97,"El Rosario,\nMexico",Amma Szal,NaN,mo,NaN,375 m,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
64,KO 685,NaN,M,NaN,arsha Collins 3rd Grade\nest Elementary,"Wamego, KS",9/16/96,9/18/96,NaN,"ouisville, KS",NaN,ami Kabril,2 d,3 m
65,HY 802\nDP 521,NaN,NaN,NaN,icki Allred\nutnam City North H.S.,"Oklahoma City,\nOK",9/30/96,10/1/96,NaN,"klahoma City,\nK",NaN,om Bailey,1 d,2 m
66,NaN,NaN,M,NaN,alter Knapp,"Topeka, KS",10/12/96,10/13/96,NaN,"opeka, KS",NaN,ancy Mote,1 d,2 m
67,DX 480,NaN,F,NaN,ecelia Peterson\nettleton Magnet School,"Duluth, MN",10/12/96,10/12/96,NaN,"uluth, MN",NaN,ick Meiers,0 d,1 m
68,CT 641,NaN,M,NaN,hip Clint,"Dallas, TX",9/24/96,9/24/96,NaN,"allas, TX",NaN,aren A.\npton,0 d,1 m

### Drop tagger and reporter identification

In [6]:
df.drop(["Tagger", "Reporter"], axis = 1, inplace = True)
df

    Tag No.  Tag City, State    Tagged  Reported Report City, State Miles
0     XA226      Oshkosh, WI  09/25/98  04/06/99   Rancho Viejo, TX  1814
1     WJ990     Columbia, CT  08/29/98  03/01/99     El Rosario, MX  2231
2     BG365  Wallingford, CT  09/03/98  02/10/99     El Rosario, MX  2199
3     WK478   West Haven, CT  09/21/98  02/17/99     El Rosario, MX  2186
4     WK499   West Haven, CT  09/26/98  04/05/99      Angangueo, MX  2186
..      ...              ...       ...       ...                ...   ...
454   DA348              NaN       NaN  03/01/99     El Rosario, MX   NaN
455   DA382              NaN       NaN  03/01/99     El Rosario, MX   NaN
456   NK076              NaN       NaN  02/10/99     El Rosario, MX   NaN
457   SK300              NaN       NaN  02/19/99     El Rosario, MX   NaN
458   CB963              NaN       NaN  04/05/99      Angangueo, MX   NaN

[459 rows x 6 columns]

### Rename columns to match other years

In [7]:
df.rename(columns={'Tagged': 'Tag Date', 'Reported': 'Report Date'}, inplace=True)

### Split & rename combined columns in Tagged category

In [8]:
df2 = df['Tag City, State'].str.split(', ', expand=True)
df2.columns = ['tag_city', 'Tag State']
df2

        tag_city Tag State
0        Oshkosh        WI
1       Columbia        CT
2    Wallingford        CT
3     West Haven        CT
4     West Haven        CT
..           ...       ...
454          NaN       NaN
455          NaN       NaN
456          NaN       NaN
457          NaN       NaN
458          NaN       NaN

[459 rows x 2 columns]

### Split & Rename combined columns in Reported category

In [9]:
df3 = df['Report City, State'].str.split(', ', expand=True)
df3.columns = ['report_city', 'Report State']
df3.loc[df3['Report State'] == 'MX', 'Report State'] = 'MICH'
df3

      report_city Report State
0    Rancho Viejo           TX
1      El Rosario         MICH
2      El Rosario         MICH
3      El Rosario         MICH
4       Angangueo         MICH
..            ...          ...
454    El Rosario         MICH
455    El Rosario         MICH
456    El Rosario         MICH
457    El Rosario         MICH
458     Angangueo         MICH

[459 rows x 2 columns]

### Create new column Report Country & clean up

In [10]:
add_country = df['Report City, State'].str.extract("(MX)", expand=True)
add_country.columns = ['Report Country']
add_country.loc[add_country['Report Country'] == 'MX', 'Report Country'] = 'MEXICO'
add_country.loc[add_country['Report Country'].isnull(), 'Report Country'] = 'USA'
add_country

    Report Country
0              USA
1           MEXICO
2           MEXICO
3           MEXICO
4           MEXICO
..             ...
454         MEXICO
455         MEXICO
456         MEXICO
457         MEXICO
458         MEXICO

[459 rows x 1 columns]

### Create new table with unneeded columns dropped

In [11]:
df4 = pd.concat([df, df2, df3, add_country], axis=1)
df4.drop(['Tag City, State', 'Report City, State', 'report_city', 'tag_city'], axis=1, inplace=True)
df5 = df4[['Tag No.','Tag State', 'Tag Date', 'Report State', 'Report Country', 'Report Date', 'Miles']]
new_table = df5.copy()
new_table
# new_table.loc[new_table['Report State'].str.contains(r'\s'), 'Report State'].value_counts()
# new_table.loc[new_table['Tag State'].str.contains(r'\s'), 'Tag State'].value_counts()
# new_table.loc[new_table['Tag No.'].str.contains(r'\s'), 'Tag No.'].value_counts()
# new_table.loc[new_table['Report Country'].str.contains(r'\s'), 'Report Country'].value_counts()

    Tag No. Tag State  Tag Date Report State Report Country Report Date Miles
0     XA226        WI  09/25/98           TX            USA    04/06/99  1814
1     WJ990        CT  08/29/98         MICH         MEXICO    03/01/99  2231
2     BG365        CT  09/03/98         MICH         MEXICO    02/10/99  2199
3     WK478        CT  09/21/98         MICH         MEXICO    02/17/99  2186
4     WK499        CT  09/26/98         MICH         MEXICO    04/05/99  2186
..      ...       ...       ...          ...            ...         ...   ...
454   DA348       NaN       NaN         MICH         MEXICO    03/01/99   NaN
455   DA382       NaN       NaN         MICH         MEXICO    03/01/99   NaN
456   NK076       NaN       NaN         MICH         MEXICO    02/10/99   NaN
457   SK300       NaN       NaN         MICH         MEXICO    02/19/99   NaN
458   CB963       NaN       NaN         MICH         MEXICO    04/05/99   NaN

[459 rows x 7 columns]

### Change Values in Report Date where day of month is missing
#### I chose 09/01/08 because season starts in August, and the average Tag date is in September

In [12]:
new_table.loc[new_table['Tag Date'] == "98 Season", 'Tag Date'] = '09/01/08'
new_table

    Tag No. Tag State  Tag Date Report State Report Country Report Date Miles
0     XA226        WI  09/25/98           TX            USA    04/06/99  1814
1     WJ990        CT  08/29/98         MICH         MEXICO    03/01/99  2231
2     BG365        CT  09/03/98         MICH         MEXICO    02/10/99  2199
3     WK478        CT  09/21/98         MICH         MEXICO    02/17/99  2186
4     WK499        CT  09/26/98         MICH         MEXICO    04/05/99  2186
..      ...       ...       ...          ...            ...         ...   ...
454   DA348       NaN       NaN         MICH         MEXICO    03/01/99   NaN
455   DA382       NaN       NaN         MICH         MEXICO    03/01/99   NaN
456   NK076       NaN       NaN         MICH         MEXICO    02/10/99   NaN
457   SK300       NaN       NaN         MICH         MEXICO    02/19/99   NaN
458   CB963       NaN       NaN         MICH         MEXICO    04/05/99   NaN

[459 rows x 7 columns]

### Convert date columns to DateTime datatypes

In [13]:
new_table["Tag Date"]= pd.to_datetime(new_table["Tag Date"]) 
new_table["Report Date"]= pd.to_datetime(new_table["Report Date"]) 
new_table.dtypes

Tag No.                   object
Tag State                 object
Tag Date          datetime64[ns]
Report State              object
Report Country            object
Report Date       datetime64[ns]
Miles                     object
dtype: object

In [14]:
del df2, df3, df4, df5, add_country

### Export cleaned data to csv.

In [15]:
#new_table.to_csv("Monarchs1996.csv")